Notas-de-clase/clase-2022-08-12.md

# &Iacute;ndice

1.  [Convenciones de nombres](#orgecbaca1)
    1.  [Camel Case](#orgb75ed6a)
    2.  [Upper Camel Case](#orge27bf66)
    3.  [Snake case](#org69da31f)
    4.  [Subnota 1](#org42863fb)
2.  [Java](#org0e0c968)
    1.  [Instalar Java](#org69d50eb)
        1.  [Versiones destacables de Java](#org2fce2b1)
        2.  [Oracle JDK vs OpenJDK](#orgb92ac44)
    2.  [Hola Mundo en java](#org2245d31)
        1.  [Para correr:](#org51e932a)
    3.  [Subnota 2](#org3694761)



<a id="orgecbaca1"></a>

# Convenciones de nombres

Conjunto de normas para un lenguaje de programación específico que recomiendan estilos de programación, buenas prácticas y métodos para mantener el aspecto del código fuente.


<a id="orgb75ed6a"></a>

## Camel Case

El nombre se debe a que las mayúsculas a lo largo de una palabra en CamelCase se asemejan a las jorobas de un camello. La primera letra es mayúscula y la primera letra de las consiguientes palabras son mayúsculas.

Ej.

    holaMundo


<a id="orge27bf66"></a>

## Upper Camel Case

Similar al camel case, con la diferencia de que la primera letra es mayúsculas.

Ej.

    HolaMundo


<a id="org69da31f"></a>

## Snake case

Esta conveción usa minúsculas y separa palabras con un guión bajo.

Ej.

    hola_mundo


<a id="org42863fb"></a>

## Subnota 1

Es mejor programar código en inglés (nombres de variables, funciones etc).

El conocimiento debe de ser libre. Siempre tienes que enseñar a los demás, sobre todo a tus subordinados. Cuando estás empezando, crees saberlo todo, cuando eres experto, crees que no sabes mucho (Efecto Dunning-Krugger).

Siempre ser humilde con tu trabajo. No dejes que tu orgullo te evite de probar tu código. Admite tus errores.

La vida del programador es ~60% leer código. ~35% administración (coordinación con compañeros). ~10% Educación continua. ~5% enseñar a compañeros. Lo poco que queda es programar.


<a id="org0e0c968"></a>

# Java


<a id="org69d50eb"></a>

## Instalar Java

Cuando se habla de instalar Java, se puede referir a instalar la versión de Java para usuarios finales, la cual consiste en el Java Runtime Environment (JRE), o se puede referir a el Java Development Kit (JDK), el cual consiste en el JRE junto con herramientas para desarrollar en Java, tales como el compilador, el debugger, la API de Java, y la Librería de Clases de Java (JCL).

Al momento de instalar java, es pertinente verificar que versión se ha descargado. Cada nueva versión contiene funciones nuevas y correciones de errores que pueden crear incompatibilidades entre versiones. Además, versiones viejas pueden dejar de recibir soporte, dejando el código vulnerable y creando posibles brechas de seguridad.

Algunas versiones tienen soporte extendido, conocidas como versiones LTS (Long Term Service). Estas versiones tienen soporte de 8 años por Oracle, durante las cuales reciben actualizaciones de seguridad, estabilidad y rendimiento, pero no de funcionalidad. Este soporte extendido, sin embargo, tiene un costo para todos los usuarios comerciales.


<a id="org2fce2b1"></a>

### Versiones destacables de Java

<!-- This HTML table template is generated by emacs 28.1 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;Versión&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Lanzamiento&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Fin&nbsp;del&nbsp;Soporte&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Notas&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Java&nbsp;7&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Julio&nbsp;2011&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Julio&nbsp;2019&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Version&nbsp;sin&nbsp;soporte.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Java&nbsp;8&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Marzo&nbsp;2014&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Diciembre&nbsp;2030&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;La&nbsp;versión&nbsp;más&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      común.&nbsp;Instalada&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      predeterminadamente&nbsp;en&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />
      múltiples&nbsp;sistemas&nbsp;operativos.&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Java&nbsp;11&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Septiembre&nbsp;2018&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Septiembre&nbsp;2026&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;LTS&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Java&nbsp;17&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Septiembre&nbsp;2021&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Septiembre&nbsp;2029&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;LTS&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;Java&nbsp;18&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Marzo&nbsp;2022&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Septiembre&nbsp;2022&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;Versión&nbsp;más&nbsp;reciente.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
  </tr>
</table>


<a id="orgb92ac44"></a>

### Oracle JDK vs OpenJDK

Existen dos versiones del JDK, una la cual es ofrecida comercialmente por Oracle, llamada el Oracle JDK, y otra, la cual es mantenida por Oracle en conjunto con la comunidad del Código Abierto, así como por compañías como Google e IBM, llamada el OpenJDK. Este está licenciado de manera permisiva, lo que permite su uso comercial y en programas de código abierto y código libre sin costo alguno. Oracle no ofrece oficialmente versiones LTS, pero algunas compañías como Microsoft, Red Hat y JetBrains ofrecen su propia version del OpenJDK con soporte LTS.

Para usos prácticos, no existe diferencia entre el Oracle JDK y el OpenJDK, sin embargo, Oracle no ofrece soporte empresarial y extendido a usuarios del OpenJDK. Por otra parte, Oracle no puede demandarte por usar el OpenJDK comercialmente sin suscripción, como hace con el Oracle JDK. Para este curso se pueden usar cualquiera de los dos.


<a id="org2245d31"></a>

## Hola Mundo en java

    //Main.java
    public class Main {
      public static void main(String[] args) {
        System.out.println("Hello world");
      }
    }

Las clases se escriben con UpperCamelCase.

Los archivos tienen que llamarse igual que la clase principal.

La función principal se llama main.


<a id="org51e932a"></a>

### Para correr:

1.  Verifica que Java este instalado correctamente:
    
    Para verificar que Java este instalado es necesario abrir una consola, cmd o PowerShell. En Windows, esta se puede abrir siguiendo [esta guía](https://es.wikihow.com/abrir-la-l%C3%ADnea-de-comandos-en-Windows). Una vez dentro, se debe correr el siguiente comando:
    
    Java menor a 1.9
    
        java -version
    
    Java 1.9 en adelante
    
        java --version

2.  Crea el archivo Main.java y copia el código que se encuentra arriba.

3.  Dentro de la consola o cmd, se deben correr los siguientes comandos.
    
        cd dirección/a/el/archivo
        javac Main.java
        java Main

Si la consola imprime el texto "Hello world", el programa se ha compilado y ejecutado exitosamente.


<a id="org3694761"></a>

## Subnota 2

Para absorber conocimiento hay que unirse a comunidades sobre el tema.

Existen las soft skills y las hard skills. Las hard skills son las abilidades técnicas. Las soft skills son las habilidades interpersonales e intrapersonales como networking, locución, habilidades emocionales, etc.

Skill importante de aprender: saber leer errores. Se aprende a la mala.

Recomendación: ver la serie Silicon Valley.

